vivmchp/hvac_pl10/firmware/config.mcc/src/packs/PIC32CM6408PL10032_DFP/component/sercom.h
#define SERCOM_SPI_CTRLA_SWRST_Pos            _UINT32_(0)                                          /* (SERCOM_SPI_CTRLA) Software Reset Position */
#define SERCOM_SPI_CTRLA_SWRST_Msk            (_UINT32_(0x1) << SERCOM_SPI_CTRLA_SWRST_Pos)        /* (SERCOM_SPI_CTRLA) Software Reset Mask */
#define SERCOM_SPI_CTRLA_SWRST(value)         (SERCOM_SPI_CTRLA_SWRST_Msk & (_UINT32_(value) << SERCOM_SPI_CTRLA_SWRST_Pos)) /* Assignment of value for SWRST in the SERCOM_SPI_CTRLA register */
#define SERCOM_SPI_CTRLA_ENABLE_Pos           _UINT32_(1)                                          /* (SERCOM_SPI_CTRLA) Enable Position */
#define SERCOM_SPI_CTRLA_ENABLE_Msk           (_UINT32_(0x1) << SERCOM_SPI_CTRLA_ENABLE_Pos)       /* (SERCOM_SPI_CTRLA) Enable Mask */
#define SERCOM_SPI_CTRLA_ENABLE(value)        (SERCOM_SPI_CTRLA_ENABLE_Msk & (_UINT32_(value) << SERCOM_SPI_CTRLA_ENABLE_Pos)) /* Assignment of value for ENABLE in the SERCOM_SPI_CTRLA register */
#define SERCOM_SPI_CTRLA_MODE_Pos             _UINT32_(2)                                          /* (SERCOM_SPI_CTRLA) Operating Mode Position */
#define SERCOM_SPI_CTRLA_MODE_Msk             (_UINT32_(0x7) << SERCOM_SPI_CTRLA_MODE_Pos)         /* (SERCOM_SPI_CTRLA) Operating Mode Mask */
#define SERCOM_SPI_CTRLA_MODE(value)          (SERCOM_SPI_CTRLA_MODE_Msk & (_UINT32_(value) << SERCOM_SPI_CTRLA_MODE_Pos)) /* Assignment of value for MODE in the SERCOM_SPI_CTRLA register */
#define   SERCOM_SPI_CTRLA_MODE_USART_EXT_Val _UINT32_(0x0)                                        /* (SERCOM_SPI_CTRLA) USART with external clock  */
#define   SERCOM_SPI_CTRLA_MODE_USART_INT_Val _UINT32_(0x1)                                        /* (SERCOM_SPI_CTRLA) USART with internal clock  */
#define   SERCOM_SPI_CTRLA_MODE_SPI_SLAVE_Val _UINT32_(0x2)                                        /* (SERCOM_SPI_CTRLA) SPI Client mode  */
#define   SERCOM_SPI_CTRLA_MODE_SPI_MASTER_Val _UINT32_(0x3)                                        /* (SERCOM_SPI_CTRLA) SPI Host mode  */
#define   SERCOM_SPI_CTRLA_MODE_I2C_SLAVE_Val _UINT32_(0x4)                                        /* (SERCOM_SPI_CTRLA) I2C Client mode  */
#define   SERCOM_SPI_CTRLA_MODE_I2C_MASTER_Val _UINT32_(0x5)                                        /* (SERCOM_SPI_CTRLA) I2C Host mode  */
#define SERCOM_SPI_CTRLA_MODE_USART_EXT       (SERCOM_SPI_CTRLA_MODE_USART_EXT_Val << SERCOM_SPI_CTRLA_MODE_Pos) /* (SERCOM_SPI_CTRLA) USART with external clock Position */
#define SERCOM_SPI_CTRLA_MODE_USART_INT       (SERCOM_SPI_CTRLA_MODE_USART_INT_Val << SERCOM_SPI_CTRLA_MODE_Pos) /* (SERCOM_SPI_CTRLA) USART with internal clock Position */
#define SERCOM_SPI_CTRLA_MODE_SPI_SLAVE       (SERCOM_SPI_CTRLA_MODE_SPI_SLAVE_Val << SERCOM_SPI_CTRLA_MODE_Pos) /* (SERCOM_SPI_CTRLA) SPI Client mode Position */
#define SERCOM_SPI_CTRLA_MODE_SPI_MASTER      (SERCOM_SPI_CTRLA_MODE_SPI_MASTER_Val << SERCOM_SPI_CTRLA_MODE_Pos) /* (SERCOM_SPI_CTRLA) SPI Host mode Position */
#define SERCOM_SPI_CTRLA_MODE_I2C_SLAVE       (SERCOM_SPI_CTRLA_MODE_I2C_SLAVE_Val << SERCOM_SPI_CTRLA_MODE_Pos) /* (SERCOM_SPI_CTRLA) I2C Client mode Position */
#define SERCOM_SPI_CTRLA_MODE_I2C_MASTER      (SERCOM_SPI_CTRLA_MODE_I2C_MASTER_Val << SERCOM_SPI_CTRLA_MODE_Pos) /* (SERCOM_SPI_CTRLA) I2C Host mode Position */
#define SERCOM_SPI_CTRLA_RUNSTDBY_Pos         _UINT32_(7)                                          /* (SERCOM_SPI_CTRLA) Run In Standby Position */
#define SERCOM_SPI_CTRLA_RUNSTDBY_Msk         (_UINT32_(0x1) << SERCOM_SPI_CTRLA_RUNSTDBY_Pos)     /* (SERCOM_SPI_CTRLA) Run In Standby Mask */
#define SERCOM_SPI_CTRLA_RUNSTDBY(value)      (SERCOM_SPI_CTRLA_RUNSTDBY_Msk & (_UINT32_(value) << SERCOM_SPI_CTRLA_RUNSTDBY_Pos)) /* Assignment of value for RUNSTDBY in the SERCOM_SPI_CTRLA register */
#define SERCOM_SPI_CTRLA_IBON_Pos             _UINT32_(8)                                          /* (SERCOM_SPI_CTRLA) Immediate Buffer Overflow Notification Position */
#define SERCOM_SPI_CTRLA_IBON_Msk             (_UINT32_(0x1) << SERCOM_SPI_CTRLA_IBON_Pos)         /* (SERCOM_SPI_CTRLA) Immediate Buffer Overflow Notification Mask */
#define SERCOM_SPI_CTRLA_IBON(value)          (SERCOM_SPI_CTRLA_IBON_Msk & (_UINT32_(value) << SERCOM_SPI_CTRLA_IBON_Pos)) /* Assignment of value for IBON in the SERCOM_SPI_CTRLA register */
#define SERCOM_SPI_CTRLA_DOPO_Pos             _UINT32_(16)                                         /* (SERCOM_SPI_CTRLA) Data Out Pinout Position */
#define SERCOM_SPI_CTRLA_DOPO_Msk             (_UINT32_(0x3) << SERCOM_SPI_CTRLA_DOPO_Pos)         /* (SERCOM_SPI_CTRLA) Data Out Pinout Mask */
#define SERCOM_SPI_CTRLA_DOPO(value)          (SERCOM_SPI_CTRLA_DOPO_Msk & (_UINT32_(value) << SERCOM_SPI_CTRLA_DOPO_Pos)) /* Assignment of value for DOPO in the SERCOM_SPI_CTRLA register */
#define   SERCOM_SPI_CTRLA_DOPO_MUX0_Val      _UINT32_(0x0)                                        /* (SERCOM_SPI_CTRLA) PAD[0]=DO, PAD[1]=SCK, PAD[2]=SS  */
#define   SERCOM_SPI_CTRLA_DOPO_MUX1_Val      _UINT32_(0x1)                                        /* (SERCOM_SPI_CTRLA) PAD[2]=DO, PAD[3]=SCK, PAD[1]=SS  */
#define   SERCOM_SPI_CTRLA_DOPO_MUX2_Val      _UINT32_(0x2)                                        /* (SERCOM_SPI_CTRLA) PAD[3]=DO, PAD[1]=SCK, PAD[2]=SS  */
#define   SERCOM_SPI_CTRLA_DOPO_MUX3_Val      _UINT32_(0x3)                                        /* (SERCOM_SPI_CTRLA) PAD[0]=DO, PAD[3]=SCK, PAD[1]=SS  */
#define SERCOM_SPI_CTRLA_DOPO_MUX0            (SERCOM_SPI_CTRLA_DOPO_MUX0_Val << SERCOM_SPI_CTRLA_DOPO_Pos) /* (SERCOM_SPI_CTRLA) PAD[0]=DO, PAD[1]=SCK, PAD[2]=SS Position */
#define SERCOM_SPI_CTRLA_DOPO_MUX1            (SERCOM_SPI_CTRLA_DOPO_MUX1_Val << SERCOM_SPI_CTRLA_DOPO_Pos) /* (SERCOM_SPI_CTRLA) PAD[2]=DO, PAD[3]=SCK, PAD[1]=SS Position */
#define SERCOM_SPI_CTRLA_DOPO_MUX2            (SERCOM_SPI_CTRLA_DOPO_MUX2_Val << SERCOM_SPI_CTRLA_DOPO_Pos) /* (SERCOM_SPI_CTRLA) PAD[3]=DO, PAD[1]=SCK, PAD[2]=SS Position */
#define SERCOM_SPI_CTRLA_DOPO_MUX3            (SERCOM_SPI_CTRLA_DOPO_MUX3_Val << SERCOM_SPI_CTRLA_DOPO_Pos) /* (SERCOM_SPI_CTRLA) PAD[0]=DO, PAD[3]=SCK, PAD[1]=SS Position */
#define SERCOM_SPI_CTRLA_DIPO_Pos             _UINT32_(20)                                         /* (SERCOM_SPI_CTRLA) Data In Pinout Position */
#define SERCOM_SPI_CTRLA_DIPO_Msk             (_UINT32_(0x3) << SERCOM_SPI_CTRLA_DIPO_Pos)         /* (SERCOM_SPI_CTRLA) Data In Pinout Mask */
#define SERCOM_SPI_CTRLA_DIPO(value)          (SERCOM_SPI_CTRLA_DIPO_Msk & (_UINT32_(value) << SERCOM_SPI_CTRLA_DIPO_Pos)) /* Assignment of value for DIPO in the SERCOM_SPI_CTRLA register */
#define   SERCOM_SPI_CTRLA_DIPO_MUX0_Val      _UINT32_(0x0)                                        /* (SERCOM_SPI_CTRLA) SERCOM PAD[0] is used as data input  */
#define   SERCOM_SPI_CTRLA_DIPO_MUX1_Val      _UINT32_(0x1)                                        /* (SERCOM_SPI_CTRLA) SERCOM PAD[1] is used as data input  */
#define   SERCOM_SPI_CTRLA_DIPO_MUX2_Val      _UINT32_(0x2)                                        /* (SERCOM_SPI_CTRLA) SERCOM PAD[2] is used as data input  */
#define   SERCOM_SPI_CTRLA_DIPO_MUX3_Val      _UINT32_(0x3)                                        /* (SERCOM_SPI_CTRLA) SERCOM PAD[3] is used as data input  */
#define SERCOM_SPI_CTRLA_DIPO_MUX0            (SERCOM_SPI_CTRLA_DIPO_MUX0_Val << SERCOM_SPI_CTRLA_DIPO_Pos) /* (SERCOM_SPI_CTRLA) SERCOM PAD[0] is used as data input Position */
#define SERCOM_SPI_CTRLA_DIPO_MUX1            (SERCOM_SPI_CTRLA_DIPO_MUX1_Val << SERCOM_SPI_CTRLA_DIPO_Pos) /* (SERCOM_SPI_CTRLA) SERCOM PAD[1] is used as data input Position */
#define SERCOM_SPI_CTRLA_DIPO_MUX2            (SERCOM_SPI_CTRLA_DIPO_MUX2_Val << SERCOM_SPI_CTRLA_DIPO_Pos) /* (SERCOM_SPI_CTRLA) SERCOM PAD[2] is used as data input Position */
#define SERCOM_SPI_CTRLA_DIPO_MUX3            (SERCOM_SPI_CTRLA_DIPO_MUX3_Val << SERCOM_SPI_CTRLA_DIPO_Pos) /* (SERCOM_SPI_CTRLA) SERCOM PAD[3] is used as data input Position */
#define SERCOM_SPI_CTRLA_FORM_Pos             _UINT32_(24)                                         /* (SERCOM_SPI_CTRLA) Frame Format Position */
#define SERCOM_SPI_CTRLA_FORM_Msk             (_UINT32_(0xF) << SERCOM_SPI_CTRLA_FORM_Pos)         /* (SERCOM_SPI_CTRLA) Frame Format Mask */
#define SERCOM_SPI_CTRLA_FORM(value)          (SERCOM_SPI_CTRLA_FORM_Msk & (_UINT32_(value) << SERCOM_SPI_CTRLA_FORM_Pos)) /* Assignment of value for FORM in the SERCOM_SPI_CTRLA register */
#define   SERCOM_SPI_CTRLA_FORM_SPI_FRAME_Val _UINT32_(0x0)                                        /* (SERCOM_SPI_CTRLA) SPI Frame  */
#define   SERCOM_SPI_CTRLA_FORM_SPI_FRAME_WITH_ADDR_Val _UINT32_(0x2)                                        /* (SERCOM_SPI_CTRLA) SPI Frame with Address  */
#define SERCOM_SPI_CTRLA_FORM_SPI_FRAME       (SERCOM_SPI_CTRLA_FORM_SPI_FRAME_Val << SERCOM_SPI_CTRLA_FORM_Pos) /* (SERCOM_SPI_CTRLA) SPI Frame Position */
#define SERCOM_SPI_CTRLA_FORM_SPI_FRAME_WITH_ADDR (SERCOM_SPI_CTRLA_FORM_SPI_FRAME_WITH_ADDR_Val << SERCOM_SPI_CTRLA_FORM_Pos) /* (SERCOM_SPI_CTRLA) SPI Frame with Address Position */
#define SERCOM_SPI_CTRLA_CPHA_Pos             _UINT32_(28)                                         /* (SERCOM_SPI_CTRLA) Clock Phase Position */
#define SERCOM_SPI_CTRLA_CPHA_Msk             (_UINT32_(0x1) << SERCOM_SPI_CTRLA_CPHA_Pos)         /* (SERCOM_SPI_CTRLA) Clock Phase Mask */
#define SERCOM_SPI_CTRLA_CPHA(value)          (SERCOM_SPI_CTRLA_CPHA_Msk & (_UINT32_(value) << SERCOM_SPI_CTRLA_CPHA_Pos)) /* Assignment of value for CPHA in the SERCOM_SPI_CTRLA register */
#define   SERCOM_SPI_CTRLA_CPHA_LEADING_EDGE_Val _UINT32_(0x0)                                        /* (SERCOM_SPI_CTRLA) The data is sampled on a leading SCK edge and changed on a trailing SCK edge  */
#define   SERCOM_SPI_CTRLA_CPHA_TRAILING_EDGE_Val _UINT32_(0x1)                                        /* (SERCOM_SPI_CTRLA) The data is sampled on a trailing SCK edge and changed on a leading SCK edge  */
#define SERCOM_SPI_CTRLA_CPHA_LEADING_EDGE    (SERCOM_SPI_CTRLA_CPHA_LEADING_EDGE_Val << SERCOM_SPI_CTRLA_CPHA_Pos) /* (SERCOM_SPI_CTRLA) The data is sampled on a leading SCK edge and changed on a trailing SCK edge Position */
#define SERCOM_SPI_CTRLA_CPHA_TRAILING_EDGE   (SERCOM_SPI_CTRLA_CPHA_TRAILING_EDGE_Val << SERCOM_SPI_CTRLA_CPHA_Pos) /* (SERCOM_SPI_CTRLA) The data is sampled on a trailing SCK edge and changed on a leading SCK edge Position */
#define SERCOM_SPI_CTRLA_CPOL_Pos             _UINT32_(29)                                         /* (SERCOM_SPI_CTRLA) Clock Polarity Position */
#define SERCOM_SPI_CTRLA_CPOL_Msk             (_UINT32_(0x1) << SERCOM_SPI_CTRLA_CPOL_Pos)         /* (SERCOM_SPI_CTRLA) Clock Polarity Mask */
#define SERCOM_SPI_CTRLA_CPOL(value)          (SERCOM_SPI_CTRLA_CPOL_Msk & (_UINT32_(value) << SERCOM_SPI_CTRLA_CPOL_Pos)) /* Assignment of value for CPOL in the SERCOM_SPI_CTRLA register */
#define   SERCOM_SPI_CTRLA_CPOL_IDLE_LOW_Val  _UINT32_(0x0)                                        /* (SERCOM_SPI_CTRLA) SCK is low when IDLE. The leading edge of a clock cycle is a rising edge, while the trailing edge is a falling edge.  */
#define   SERCOM_SPI_CTRLA_CPOL_IDLE_HIGH_Val _UINT32_(0x1)                                        /* (SERCOM_SPI_CTRLA) SCK is high when IDLE. The leading edge of a clock cycle is a falling edge, while the trailing edge is a rising edge.  */
#define SERCOM_SPI_CTRLA_CPOL_IDLE_LOW        (SERCOM_SPI_CTRLA_CPOL_IDLE_LOW_Val << SERCOM_SPI_CTRLA_CPOL_Pos) /* (SERCOM_SPI_CTRLA) SCK is low when IDLE. The leading edge of a clock cycle is a rising edge, while the trailing edge is a falling edge. Position */
#define SERCOM_SPI_CTRLA_CPOL_IDLE_HIGH       (SERCOM_SPI_CTRLA_CPOL_IDLE_HIGH_Val << SERCOM_SPI_CTRLA_CPOL_Pos) /* (SERCOM_SPI_CTRLA) SCK is high when IDLE. The leading edge of a clock cycle is a falling edge, while the trailing edge is a rising edge. Position */
#define SERCOM_SPI_CTRLA_DORD_Pos             _UINT32_(30)                                         /* (SERCOM_SPI_CTRLA) Data Order Position */
#define SERCOM_SPI_CTRLA_DORD_Msk             (_UINT32_(0x1) << SERCOM_SPI_CTRLA_DORD_Pos)         /* (SERCOM_SPI_CTRLA) Data Order Mask */
#define SERCOM_SPI_CTRLA_DORD(value)          (SERCOM_SPI_CTRLA_DORD_Msk & (_UINT32_(value) << SERCOM_SPI_CTRLA_DORD_Pos)) /* Assignment of value for DORD in the SERCOM_SPI_CTRLA register */
#define   SERCOM_SPI_CTRLA_DORD_MSB_Val       _UINT32_(0x0)                                        /* (SERCOM_SPI_CTRLA) MSb is transferred first  */
#define   SERCOM_SPI_CTRLA_DORD_LSB_Val       _UINT32_(0x1)                                        /* (SERCOM_SPI_CTRLA) LSb is transferred first  */
#define SERCOM_SPI_CTRLA_DORD_MSB             (SERCOM_SPI_CTRLA_DORD_MSB_Val << SERCOM_SPI_CTRLA_DORD_Pos) /* (SERCOM_SPI_CTRLA) MSb is transferred first Position */
#define SERCOM_SPI_CTRLA_DORD_LSB             (SERCOM_SPI_CTRLA_DORD_LSB_Val << SERCOM_SPI_CTRLA_DORD_Pos) /* (SERCOM_SPI_CTRLA) LSb is transferred first Position */
#define SERCOM_SPI_CTRLA_Msk                  _UINT32_(0x7F33019F)                                 /* (SERCOM_SPI_CTRLA) Register Mask  */


/* -------- SERCOM_USART_CTRLA : (SERCOM Offset: 0x00) (R/W 32) USART Control A -------- */
#define SERCOM_USART_CTRLA_RESETVALUE         _UINT32_(0x00)                                       /*  (SERCOM_USART_CTRLA) USART Control A  Reset Value */

