vivmchp/hvac_pl10/firmware/config.mcc/src/packs/PIC32CM6408PL10032_DFP/component/sercom.h
#define SERCOM_USART_CTRLA_SWRST_Pos          _UINT32_(0)                                          /* (SERCOM_USART_CTRLA) Software Reset Position */
#define SERCOM_USART_CTRLA_SWRST_Msk          (_UINT32_(0x1) << SERCOM_USART_CTRLA_SWRST_Pos)      /* (SERCOM_USART_CTRLA) Software Reset Mask */
#define SERCOM_USART_CTRLA_SWRST(value)       (SERCOM_USART_CTRLA_SWRST_Msk & (_UINT32_(value) << SERCOM_USART_CTRLA_SWRST_Pos)) /* Assignment of value for SWRST in the SERCOM_USART_CTRLA register */
#define SERCOM_USART_CTRLA_ENABLE_Pos         _UINT32_(1)                                          /* (SERCOM_USART_CTRLA) Enable Position */
#define SERCOM_USART_CTRLA_ENABLE_Msk         (_UINT32_(0x1) << SERCOM_USART_CTRLA_ENABLE_Pos)     /* (SERCOM_USART_CTRLA) Enable Mask */
#define SERCOM_USART_CTRLA_ENABLE(value)      (SERCOM_USART_CTRLA_ENABLE_Msk & (_UINT32_(value) << SERCOM_USART_CTRLA_ENABLE_Pos)) /* Assignment of value for ENABLE in the SERCOM_USART_CTRLA register */
#define SERCOM_USART_CTRLA_MODE_Pos           _UINT32_(2)                                          /* (SERCOM_USART_CTRLA) Operating Mode Position */
#define SERCOM_USART_CTRLA_MODE_Msk           (_UINT32_(0x7) << SERCOM_USART_CTRLA_MODE_Pos)       /* (SERCOM_USART_CTRLA) Operating Mode Mask */
#define SERCOM_USART_CTRLA_MODE(value)        (SERCOM_USART_CTRLA_MODE_Msk & (_UINT32_(value) << SERCOM_USART_CTRLA_MODE_Pos)) /* Assignment of value for MODE in the SERCOM_USART_CTRLA register */
#define   SERCOM_USART_CTRLA_MODE_USART_EXT_Val _UINT32_(0x0)                                        /* (SERCOM_USART_CTRLA) USART with external clock  */
#define   SERCOM_USART_CTRLA_MODE_USART_INT_Val _UINT32_(0x1)                                        /* (SERCOM_USART_CTRLA) USART with internal clock  */
#define   SERCOM_USART_CTRLA_MODE_SPI_SLAVE_Val _UINT32_(0x2)                                        /* (SERCOM_USART_CTRLA) SPI Client mode  */
#define   SERCOM_USART_CTRLA_MODE_SPI_MASTER_Val _UINT32_(0x3)                                        /* (SERCOM_USART_CTRLA) SPI Host mode  */
#define   SERCOM_USART_CTRLA_MODE_I2C_SLAVE_Val _UINT32_(0x4)                                        /* (SERCOM_USART_CTRLA) I2C Client mode  */
#define   SERCOM_USART_CTRLA_MODE_I2C_MASTER_Val _UINT32_(0x5)                                        /* (SERCOM_USART_CTRLA) I2C Host mode  */
#define SERCOM_USART_CTRLA_MODE_USART_EXT     (SERCOM_USART_CTRLA_MODE_USART_EXT_Val << SERCOM_USART_CTRLA_MODE_Pos) /* (SERCOM_USART_CTRLA) USART with external clock Position */
#define SERCOM_USART_CTRLA_MODE_USART_INT     (SERCOM_USART_CTRLA_MODE_USART_INT_Val << SERCOM_USART_CTRLA_MODE_Pos) /* (SERCOM_USART_CTRLA) USART with internal clock Position */
#define SERCOM_USART_CTRLA_MODE_SPI_SLAVE     (SERCOM_USART_CTRLA_MODE_SPI_SLAVE_Val << SERCOM_USART_CTRLA_MODE_Pos) /* (SERCOM_USART_CTRLA) SPI Client mode Position */
#define SERCOM_USART_CTRLA_MODE_SPI_MASTER    (SERCOM_USART_CTRLA_MODE_SPI_MASTER_Val << SERCOM_USART_CTRLA_MODE_Pos) /* (SERCOM_USART_CTRLA) SPI Host mode Position */
#define SERCOM_USART_CTRLA_MODE_I2C_SLAVE     (SERCOM_USART_CTRLA_MODE_I2C_SLAVE_Val << SERCOM_USART_CTRLA_MODE_Pos) /* (SERCOM_USART_CTRLA) I2C Client mode Position */
#define SERCOM_USART_CTRLA_MODE_I2C_MASTER    (SERCOM_USART_CTRLA_MODE_I2C_MASTER_Val << SERCOM_USART_CTRLA_MODE_Pos) /* (SERCOM_USART_CTRLA) I2C Host mode Position */
#define SERCOM_USART_CTRLA_RUNSTDBY_Pos       _UINT32_(7)                                          /* (SERCOM_USART_CTRLA) Run In Standby Position */
#define SERCOM_USART_CTRLA_RUNSTDBY_Msk       (_UINT32_(0x1) << SERCOM_USART_CTRLA_RUNSTDBY_Pos)   /* (SERCOM_USART_CTRLA) Run In Standby Mask */
#define SERCOM_USART_CTRLA_RUNSTDBY(value)    (SERCOM_USART_CTRLA_RUNSTDBY_Msk & (_UINT32_(value) << SERCOM_USART_CTRLA_RUNSTDBY_Pos)) /* Assignment of value for RUNSTDBY in the SERCOM_USART_CTRLA register */
#define SERCOM_USART_CTRLA_IBON_Pos           _UINT32_(8)                                          /* (SERCOM_USART_CTRLA) Immediate Buffer Overflow Notification Position */
#define SERCOM_USART_CTRLA_IBON_Msk           (_UINT32_(0x1) << SERCOM_USART_CTRLA_IBON_Pos)       /* (SERCOM_USART_CTRLA) Immediate Buffer Overflow Notification Mask */
#define SERCOM_USART_CTRLA_IBON(value)        (SERCOM_USART_CTRLA_IBON_Msk & (_UINT32_(value) << SERCOM_USART_CTRLA_IBON_Pos)) /* Assignment of value for IBON in the SERCOM_USART_CTRLA register */
#define SERCOM_USART_CTRLA_SAMPR_Pos          _UINT32_(13)                                         /* (SERCOM_USART_CTRLA) Sample Rate Position */
#define SERCOM_USART_CTRLA_SAMPR_Msk          (_UINT32_(0x7) << SERCOM_USART_CTRLA_SAMPR_Pos)      /* (SERCOM_USART_CTRLA) Sample Rate Mask */
#define SERCOM_USART_CTRLA_SAMPR(value)       (SERCOM_USART_CTRLA_SAMPR_Msk & (_UINT32_(value) << SERCOM_USART_CTRLA_SAMPR_Pos)) /* Assignment of value for SAMPR in the SERCOM_USART_CTRLA register */
#define   SERCOM_USART_CTRLA_SAMPR_16X_ARITHMETIC_Val _UINT32_(0x0)                                        /* (SERCOM_USART_CTRLA) 16x over-sampling using arithmetic baud rate generation  */
#define   SERCOM_USART_CTRLA_SAMPR_16X_FRACTIONAL_Val _UINT32_(0x1)                                        /* (SERCOM_USART_CTRLA) 16x over-sampling using fractional baud rate generation  */
#define   SERCOM_USART_CTRLA_SAMPR_8X_ARITHMETIC_Val _UINT32_(0x2)                                        /* (SERCOM_USART_CTRLA) 8x over-sampling using arithmetic baud rate generation  */
#define   SERCOM_USART_CTRLA_SAMPR_8X_FRACTIONAL_Val _UINT32_(0x3)                                        /* (SERCOM_USART_CTRLA) 8x over-sampling using fractional baud rate generation  */
#define   SERCOM_USART_CTRLA_SAMPR_3X_ARITHMETIC_Val _UINT32_(0x4)                                        /* (SERCOM_USART_CTRLA) 3x over-sampling using arithmetic baud rate generation  */
#define SERCOM_USART_CTRLA_SAMPR_16X_ARITHMETIC (SERCOM_USART_CTRLA_SAMPR_16X_ARITHMETIC_Val << SERCOM_USART_CTRLA_SAMPR_Pos) /* (SERCOM_USART_CTRLA) 16x over-sampling using arithmetic baud rate generation Position */
#define SERCOM_USART_CTRLA_SAMPR_16X_FRACTIONAL (SERCOM_USART_CTRLA_SAMPR_16X_FRACTIONAL_Val << SERCOM_USART_CTRLA_SAMPR_Pos) /* (SERCOM_USART_CTRLA) 16x over-sampling using fractional baud rate generation Position */
#define SERCOM_USART_CTRLA_SAMPR_8X_ARITHMETIC (SERCOM_USART_CTRLA_SAMPR_8X_ARITHMETIC_Val << SERCOM_USART_CTRLA_SAMPR_Pos) /* (SERCOM_USART_CTRLA) 8x over-sampling using arithmetic baud rate generation Position */
#define SERCOM_USART_CTRLA_SAMPR_8X_FRACTIONAL (SERCOM_USART_CTRLA_SAMPR_8X_FRACTIONAL_Val << SERCOM_USART_CTRLA_SAMPR_Pos) /* (SERCOM_USART_CTRLA) 8x over-sampling using fractional baud rate generation Position */
#define SERCOM_USART_CTRLA_SAMPR_3X_ARITHMETIC (SERCOM_USART_CTRLA_SAMPR_3X_ARITHMETIC_Val << SERCOM_USART_CTRLA_SAMPR_Pos) /* (SERCOM_USART_CTRLA) 3x over-sampling using arithmetic baud rate generation Position */
#define SERCOM_USART_CTRLA_TXPO_Pos           _UINT32_(16)                                         /* (SERCOM_USART_CTRLA) Transmit Data Pinout Position */
#define SERCOM_USART_CTRLA_TXPO_Msk           (_UINT32_(0x3) << SERCOM_USART_CTRLA_TXPO_Pos)       /* (SERCOM_USART_CTRLA) Transmit Data Pinout Mask */
#define SERCOM_USART_CTRLA_TXPO(value)        (SERCOM_USART_CTRLA_TXPO_Msk & (_UINT32_(value) << SERCOM_USART_CTRLA_TXPO_Pos)) /* Assignment of value for TXPO in the SERCOM_USART_CTRLA register */
#define   SERCOM_USART_CTRLA_TXPO_MUX0_Val    _UINT32_(0x0)                                        /* (SERCOM_USART_CTRLA) PAD[0]=TxD, PAD[1]=XCK  */
#define   SERCOM_USART_CTRLA_TXPO_MUX1_Val    _UINT32_(0x1)                                        /* (SERCOM_USART_CTRLA) PAD[2]=TxD, PAD[3]=XCK  */
#define   SERCOM_USART_CTRLA_TXPO_MUX2_Val    _UINT32_(0x2)                                        /* (SERCOM_USART_CTRLA) PAD[0]=TxD, PAD[2]=RTS/TE, PAD[3]=CTS  */
#define   SERCOM_USART_CTRLA_TXPO_MUX3_Val    _UINT32_(0x3)                                        /* (SERCOM_USART_CTRLA) PAD[0]=TxD, PAD[1]=XCK, PAD[2]=RTS/TE  */
#define SERCOM_USART_CTRLA_TXPO_MUX0          (SERCOM_USART_CTRLA_TXPO_MUX0_Val << SERCOM_USART_CTRLA_TXPO_Pos) /* (SERCOM_USART_CTRLA) PAD[0]=TxD, PAD[1]=XCK Position */
#define SERCOM_USART_CTRLA_TXPO_MUX1          (SERCOM_USART_CTRLA_TXPO_MUX1_Val << SERCOM_USART_CTRLA_TXPO_Pos) /* (SERCOM_USART_CTRLA) PAD[2]=TxD, PAD[3]=XCK Position */
#define SERCOM_USART_CTRLA_TXPO_MUX2          (SERCOM_USART_CTRLA_TXPO_MUX2_Val << SERCOM_USART_CTRLA_TXPO_Pos) /* (SERCOM_USART_CTRLA) PAD[0]=TxD, PAD[2]=RTS/TE, PAD[3]=CTS Position */
#define SERCOM_USART_CTRLA_TXPO_MUX3          (SERCOM_USART_CTRLA_TXPO_MUX3_Val << SERCOM_USART_CTRLA_TXPO_Pos) /* (SERCOM_USART_CTRLA) PAD[0]=TxD, PAD[1]=XCK, PAD[2]=RTS/TE Position */
#define SERCOM_USART_CTRLA_RXPO_Pos           _UINT32_(20)                                         /* (SERCOM_USART_CTRLA) Receive Data Pinout Position */
#define SERCOM_USART_CTRLA_RXPO_Msk           (_UINT32_(0x3) << SERCOM_USART_CTRLA_RXPO_Pos)       /* (SERCOM_USART_CTRLA) Receive Data Pinout Mask */
#define SERCOM_USART_CTRLA_RXPO(value)        (SERCOM_USART_CTRLA_RXPO_Msk & (_UINT32_(value) << SERCOM_USART_CTRLA_RXPO_Pos)) /* Assignment of value for RXPO in the SERCOM_USART_CTRLA register */
#define   SERCOM_USART_CTRLA_RXPO_MUX0_Val    _UINT32_(0x0)                                        /* (SERCOM_USART_CTRLA) SERCOM PAD[0] is used for data reception  */
#define   SERCOM_USART_CTRLA_RXPO_MUX1_Val    _UINT32_(0x1)                                        /* (SERCOM_USART_CTRLA) SERCOM PAD[1] is used for data reception  */
#define   SERCOM_USART_CTRLA_RXPO_MUX2_Val    _UINT32_(0x2)                                        /* (SERCOM_USART_CTRLA) SERCOM PAD[2] is used for data reception  */
#define   SERCOM_USART_CTRLA_RXPO_MUX3_Val    _UINT32_(0x3)                                        /* (SERCOM_USART_CTRLA) SERCOM PAD[3] is used for data reception  */
#define SERCOM_USART_CTRLA_RXPO_MUX0          (SERCOM_USART_CTRLA_RXPO_MUX0_Val << SERCOM_USART_CTRLA_RXPO_Pos) /* (SERCOM_USART_CTRLA) SERCOM PAD[0] is used for data reception Position */
#define SERCOM_USART_CTRLA_RXPO_MUX1          (SERCOM_USART_CTRLA_RXPO_MUX1_Val << SERCOM_USART_CTRLA_RXPO_Pos) /* (SERCOM_USART_CTRLA) SERCOM PAD[1] is used for data reception Position */
#define SERCOM_USART_CTRLA_RXPO_MUX2          (SERCOM_USART_CTRLA_RXPO_MUX2_Val << SERCOM_USART_CTRLA_RXPO_Pos) /* (SERCOM_USART_CTRLA) SERCOM PAD[2] is used for data reception Position */
#define SERCOM_USART_CTRLA_RXPO_MUX3          (SERCOM_USART_CTRLA_RXPO_MUX3_Val << SERCOM_USART_CTRLA_RXPO_Pos) /* (SERCOM_USART_CTRLA) SERCOM PAD[3] is used for data reception Position */
#define SERCOM_USART_CTRLA_SAMPA_Pos          _UINT32_(22)                                         /* (SERCOM_USART_CTRLA) Sample Adjustment Position */
#define SERCOM_USART_CTRLA_SAMPA_Msk          (_UINT32_(0x3) << SERCOM_USART_CTRLA_SAMPA_Pos)      /* (SERCOM_USART_CTRLA) Sample Adjustment Mask */
#define SERCOM_USART_CTRLA_SAMPA(value)       (SERCOM_USART_CTRLA_SAMPA_Msk & (_UINT32_(value) << SERCOM_USART_CTRLA_SAMPA_Pos)) /* Assignment of value for SAMPA in the SERCOM_USART_CTRLA register */
#define   SERCOM_USART_CTRLA_SAMPA_ADJ0_Val   _UINT32_(0x0)                                        /* (SERCOM_USART_CTRLA) 16x Over-sampling = 7-8-9; 8x Over-sampling = 3-4-5  */
#define   SERCOM_USART_CTRLA_SAMPA_ADJ1_Val   _UINT32_(0x1)                                        /* (SERCOM_USART_CTRLA) 16x Over-sampling = 9-10-11; 8x Over-sampling = 4-5-6  */
#define   SERCOM_USART_CTRLA_SAMPA_ADJ2_Val   _UINT32_(0x2)                                        /* (SERCOM_USART_CTRLA) 16x Over-sampling = 11-12-13; 8x Over-sampling = 5-6-7  */
#define   SERCOM_USART_CTRLA_SAMPA_ADJ3_Val   _UINT32_(0x3)                                        /* (SERCOM_USART_CTRLA) 16x Over-sampling = 13-14-15; 8x Over-sampling = 6-7-8  */
#define SERCOM_USART_CTRLA_SAMPA_ADJ0         (SERCOM_USART_CTRLA_SAMPA_ADJ0_Val << SERCOM_USART_CTRLA_SAMPA_Pos) /* (SERCOM_USART_CTRLA) 16x Over-sampling = 7-8-9; 8x Over-sampling = 3-4-5 Position */
#define SERCOM_USART_CTRLA_SAMPA_ADJ1         (SERCOM_USART_CTRLA_SAMPA_ADJ1_Val << SERCOM_USART_CTRLA_SAMPA_Pos) /* (SERCOM_USART_CTRLA) 16x Over-sampling = 9-10-11; 8x Over-sampling = 4-5-6 Position */
#define SERCOM_USART_CTRLA_SAMPA_ADJ2         (SERCOM_USART_CTRLA_SAMPA_ADJ2_Val << SERCOM_USART_CTRLA_SAMPA_Pos) /* (SERCOM_USART_CTRLA) 16x Over-sampling = 11-12-13; 8x Over-sampling = 5-6-7 Position */
#define SERCOM_USART_CTRLA_SAMPA_ADJ3         (SERCOM_USART_CTRLA_SAMPA_ADJ3_Val << SERCOM_USART_CTRLA_SAMPA_Pos) /* (SERCOM_USART_CTRLA) 16x Over-sampling = 13-14-15; 8x Over-sampling = 6-7-8 Position */
#define SERCOM_USART_CTRLA_FORM_Pos           _UINT32_(24)                                         /* (SERCOM_USART_CTRLA) Frame Format Position */
#define SERCOM_USART_CTRLA_FORM_Msk           (_UINT32_(0xF) << SERCOM_USART_CTRLA_FORM_Pos)       /* (SERCOM_USART_CTRLA) Frame Format Mask */
#define SERCOM_USART_CTRLA_FORM(value)        (SERCOM_USART_CTRLA_FORM_Msk & (_UINT32_(value) << SERCOM_USART_CTRLA_FORM_Pos)) /* Assignment of value for FORM in the SERCOM_USART_CTRLA register */
#define   SERCOM_USART_CTRLA_FORM_USART_FRAME_NO_PARITY_Val _UINT32_(0x0)                                        /* (SERCOM_USART_CTRLA) USART frame  */
#define   SERCOM_USART_CTRLA_FORM_USART_FRAME_WITH_PARITY_Val _UINT32_(0x1)                                        /* (SERCOM_USART_CTRLA) USART frame with parity  */
#define   SERCOM_USART_CTRLA_FORM_USART_FRAME_LINBRKGEN_Val _UINT32_(0x2)                                        /* (SERCOM_USART_CTRLA) LIN Host - Break and sync generation. See LIN Command (CTRLB.LINCMD).  */
#define   SERCOM_USART_CTRLA_FORM_USART_FRAME_AUTO_BAUD_NO_PARITY_Val _UINT32_(0x4)                                        /* (SERCOM_USART_CTRLA) Auto-baud (LIN Client) - break detection and auto-baud  */
#define   SERCOM_USART_CTRLA_FORM_USART_FRAME_AUTO_BAUD_WITH_PARITY_Val _UINT32_(0x5)                                        /* (SERCOM_USART_CTRLA) Auto-baud - break detection and auto-baud with parity  */
#define SERCOM_USART_CTRLA_FORM_USART_FRAME_NO_PARITY (SERCOM_USART_CTRLA_FORM_USART_FRAME_NO_PARITY_Val << SERCOM_USART_CTRLA_FORM_Pos) /* (SERCOM_USART_CTRLA) USART frame Position */
#define SERCOM_USART_CTRLA_FORM_USART_FRAME_WITH_PARITY (SERCOM_USART_CTRLA_FORM_USART_FRAME_WITH_PARITY_Val << SERCOM_USART_CTRLA_FORM_Pos) /* (SERCOM_USART_CTRLA) USART frame with parity Position */
#define SERCOM_USART_CTRLA_FORM_USART_FRAME_LINBRKGEN (SERCOM_USART_CTRLA_FORM_USART_FRAME_LINBRKGEN_Val << SERCOM_USART_CTRLA_FORM_Pos) /* (SERCOM_USART_CTRLA) LIN Host - Break and sync generation. See LIN Command (CTRLB.LINCMD). Position */
#define SERCOM_USART_CTRLA_FORM_USART_FRAME_AUTO_BAUD_NO_PARITY (SERCOM_USART_CTRLA_FORM_USART_FRAME_AUTO_BAUD_NO_PARITY_Val << SERCOM_USART_CTRLA_FORM_Pos) /* (SERCOM_USART_CTRLA) Auto-baud (LIN Client) - break detection and auto-baud Position */
#define SERCOM_USART_CTRLA_FORM_USART_FRAME_AUTO_BAUD_WITH_PARITY (SERCOM_USART_CTRLA_FORM_USART_FRAME_AUTO_BAUD_WITH_PARITY_Val << SERCOM_USART_CTRLA_FORM_Pos) /* (SERCOM_USART_CTRLA) Auto-baud - break detection and auto-baud with parity Position */
#define SERCOM_USART_CTRLA_CMODE_Pos          _UINT32_(28)                                         /* (SERCOM_USART_CTRLA) Communication Mode Position */
#define SERCOM_USART_CTRLA_CMODE_Msk          (_UINT32_(0x1) << SERCOM_USART_CTRLA_CMODE_Pos)      /* (SERCOM_USART_CTRLA) Communication Mode Mask */
#define SERCOM_USART_CTRLA_CMODE(value)       (SERCOM_USART_CTRLA_CMODE_Msk & (_UINT32_(value) << SERCOM_USART_CTRLA_CMODE_Pos)) /* Assignment of value for CMODE in the SERCOM_USART_CTRLA register */
#define   SERCOM_USART_CTRLA_CMODE_ASYNC_Val  _UINT32_(0x0)                                        /* (SERCOM_USART_CTRLA) Asynchronous communication  */
#define   SERCOM_USART_CTRLA_CMODE_SYNC_Val   _UINT32_(0x1)                                        /* (SERCOM_USART_CTRLA) Synchronous communication  */
#define SERCOM_USART_CTRLA_CMODE_ASYNC        (SERCOM_USART_CTRLA_CMODE_ASYNC_Val << SERCOM_USART_CTRLA_CMODE_Pos) /* (SERCOM_USART_CTRLA) Asynchronous communication Position */
#define SERCOM_USART_CTRLA_CMODE_SYNC         (SERCOM_USART_CTRLA_CMODE_SYNC_Val << SERCOM_USART_CTRLA_CMODE_Pos) /* (SERCOM_USART_CTRLA) Synchronous communication Position */
#define SERCOM_USART_CTRLA_CPOL_Pos           _UINT32_(29)                                         /* (SERCOM_USART_CTRLA) Clock Polarity Position */
#define SERCOM_USART_CTRLA_CPOL_Msk           (_UINT32_(0x1) << SERCOM_USART_CTRLA_CPOL_Pos)       /* (SERCOM_USART_CTRLA) Clock Polarity Mask */
#define SERCOM_USART_CTRLA_CPOL(value)        (SERCOM_USART_CTRLA_CPOL_Msk & (_UINT32_(value) << SERCOM_USART_CTRLA_CPOL_Pos)) /* Assignment of value for CPOL in the SERCOM_USART_CTRLA register */
#define   SERCOM_USART_CTRLA_CPOL_IDLE_LOW_Val _UINT32_(0x0)                                        /* (SERCOM_USART_CTRLA) TxD Change: Rising XCK edge, RxD Sample: Falling XCK edge  */
#define   SERCOM_USART_CTRLA_CPOL_IDLE_HIGH_Val _UINT32_(0x1)                                        /* (SERCOM_USART_CTRLA) TxD Change: Falling XCK edge, RxD Sample: Rising XCK edge  */
#define SERCOM_USART_CTRLA_CPOL_IDLE_LOW      (SERCOM_USART_CTRLA_CPOL_IDLE_LOW_Val << SERCOM_USART_CTRLA_CPOL_Pos) /* (SERCOM_USART_CTRLA) TxD Change: Rising XCK edge, RxD Sample: Falling XCK edge Position */
#define SERCOM_USART_CTRLA_CPOL_IDLE_HIGH     (SERCOM_USART_CTRLA_CPOL_IDLE_HIGH_Val << SERCOM_USART_CTRLA_CPOL_Pos) /* (SERCOM_USART_CTRLA) TxD Change: Falling XCK edge, RxD Sample: Rising XCK edge Position */
#define SERCOM_USART_CTRLA_DORD_Pos           _UINT32_(30)                                         /* (SERCOM_USART_CTRLA) Data Order Position */
#define SERCOM_USART_CTRLA_DORD_Msk           (_UINT32_(0x1) << SERCOM_USART_CTRLA_DORD_Pos)       /* (SERCOM_USART_CTRLA) Data Order Mask */
#define SERCOM_USART_CTRLA_DORD(value)        (SERCOM_USART_CTRLA_DORD_Msk & (_UINT32_(value) << SERCOM_USART_CTRLA_DORD_Pos)) /* Assignment of value for DORD in the SERCOM_USART_CTRLA register */
#define   SERCOM_USART_CTRLA_DORD_MSB_Val     _UINT32_(0x0)                                        /* (SERCOM_USART_CTRLA) MSb is transferred first  */
#define   SERCOM_USART_CTRLA_DORD_LSB_Val     _UINT32_(0x1)                                        /* (SERCOM_USART_CTRLA) LSb is transferred first  */
#define SERCOM_USART_CTRLA_DORD_MSB           (SERCOM_USART_CTRLA_DORD_MSB_Val << SERCOM_USART_CTRLA_DORD_Pos) /* (SERCOM_USART_CTRLA) MSb is transferred first Position */
#define SERCOM_USART_CTRLA_DORD_LSB           (SERCOM_USART_CTRLA_DORD_LSB_Val << SERCOM_USART_CTRLA_DORD_Pos) /* (SERCOM_USART_CTRLA) LSb is transferred first Position */
#define SERCOM_USART_CTRLA_Msk                _UINT32_(0x7FF3E19F)                                 /* (SERCOM_USART_CTRLA) Register Mask  */


