vivmchp/hvac_pl10/firmware/config.mcc/src/packs/PIC32CM6408PL10032_DFP/component/sercom.h
/* -------- SERCOM_USART_CTRLC : (SERCOM Offset: 0x08) (R/W 32) USART Control C -------- */
#define SERCOM_USART_CTRLC_RESETVALUE         _UINT32_(0x00)                                       /*  (SERCOM_USART_CTRLC) USART Control C  Reset Value */

#define SERCOM_USART_CTRLC_GTIME_Pos          _UINT32_(0)                                          /* (SERCOM_USART_CTRLC) Guard Time Position */
#define SERCOM_USART_CTRLC_GTIME_Msk          (_UINT32_(0x7) << SERCOM_USART_CTRLC_GTIME_Pos)      /* (SERCOM_USART_CTRLC) Guard Time Mask */
#define SERCOM_USART_CTRLC_GTIME(value)       (SERCOM_USART_CTRLC_GTIME_Msk & (_UINT32_(value) << SERCOM_USART_CTRLC_GTIME_Pos)) /* Assignment of value for GTIME in the SERCOM_USART_CTRLC register */
#define SERCOM_USART_CTRLC_BRKLEN_Pos         _UINT32_(8)                                          /* (SERCOM_USART_CTRLC) LIN Host Break Length Position */
#define SERCOM_USART_CTRLC_BRKLEN_Msk         (_UINT32_(0x3) << SERCOM_USART_CTRLC_BRKLEN_Pos)     /* (SERCOM_USART_CTRLC) LIN Host Break Length Mask */
#define SERCOM_USART_CTRLC_BRKLEN(value)      (SERCOM_USART_CTRLC_BRKLEN_Msk & (_UINT32_(value) << SERCOM_USART_CTRLC_BRKLEN_Pos)) /* Assignment of value for BRKLEN in the SERCOM_USART_CTRLC register */
#define   SERCOM_USART_CTRLC_BRKLEN_13_BIT_TIME_Val _UINT32_(0x0)                                        /* (SERCOM_USART_CTRLC) The break field transmission is 13 bit times  */
#define   SERCOM_USART_CTRLC_BRKLEN_17_BIT_TIME_Val _UINT32_(0x1)                                        /* (SERCOM_USART_CTRLC) The break field transmission is 17 bit times  */
#define   SERCOM_USART_CTRLC_BRKLEN_21_BIT_TIME_Val _UINT32_(0x2)                                        /* (SERCOM_USART_CTRLC) The break field transmission is 21 bit times  */
#define   SERCOM_USART_CTRLC_BRKLEN_26_BIT_TIME_Val _UINT32_(0x3)                                        /* (SERCOM_USART_CTRLC) The break field transmission is 26 bit times  */
#define SERCOM_USART_CTRLC_BRKLEN_13_BIT_TIME (SERCOM_USART_CTRLC_BRKLEN_13_BIT_TIME_Val << SERCOM_USART_CTRLC_BRKLEN_Pos) /* (SERCOM_USART_CTRLC) The break field transmission is 13 bit times Position */
#define SERCOM_USART_CTRLC_BRKLEN_17_BIT_TIME (SERCOM_USART_CTRLC_BRKLEN_17_BIT_TIME_Val << SERCOM_USART_CTRLC_BRKLEN_Pos) /* (SERCOM_USART_CTRLC) The break field transmission is 17 bit times Position */
#define SERCOM_USART_CTRLC_BRKLEN_21_BIT_TIME (SERCOM_USART_CTRLC_BRKLEN_21_BIT_TIME_Val << SERCOM_USART_CTRLC_BRKLEN_Pos) /* (SERCOM_USART_CTRLC) The break field transmission is 21 bit times Position */
#define SERCOM_USART_CTRLC_BRKLEN_26_BIT_TIME (SERCOM_USART_CTRLC_BRKLEN_26_BIT_TIME_Val << SERCOM_USART_CTRLC_BRKLEN_Pos) /* (SERCOM_USART_CTRLC) The break field transmission is 26 bit times Position */
#define SERCOM_USART_CTRLC_HDRDLY_Pos         _UINT32_(10)                                         /* (SERCOM_USART_CTRLC) LIN Host Header Delay Position */
#define SERCOM_USART_CTRLC_HDRDLY_Msk         (_UINT32_(0x3) << SERCOM_USART_CTRLC_HDRDLY_Pos)     /* (SERCOM_USART_CTRLC) LIN Host Header Delay Mask */
#define SERCOM_USART_CTRLC_HDRDLY(value)      (SERCOM_USART_CTRLC_HDRDLY_Msk & (_UINT32_(value) << SERCOM_USART_CTRLC_HDRDLY_Pos)) /* Assignment of value for HDRDLY in the SERCOM_USART_CTRLC register */
#define   SERCOM_USART_CTRLC_HDRDLY_1_BIT_TIME_Val _UINT32_(0x0)                                        /* (SERCOM_USART_CTRLC) Delay between break and sync transmission is one bit time. Delay between sync and ID transmission is one bit time.  */
#define   SERCOM_USART_CTRLC_HDRDLY_4_BIT_TIME_Val _UINT32_(0x1)                                        /* (SERCOM_USART_CTRLC) Delay between break and sync transmission is four bit times. Delay between sync and ID transmission is four bit times.  */
#define   SERCOM_USART_CTRLC_HDRDLY_8_BIT_TIME_Val _UINT32_(0x2)                                        /* (SERCOM_USART_CTRLC) Delay between break and sync transmission is eight bit times. Delay between sync and ID transmission is four bit times.  */
#define   SERCOM_USART_CTRLC_HDRDLY_14_BIT_TIME_Val _UINT32_(0x3)                                        /* (SERCOM_USART_CTRLC) Delay between break and sync transmission is 14 bit times. Delay between sync and ID transmission is four bit times.  */
#define SERCOM_USART_CTRLC_HDRDLY_1_BIT_TIME  (SERCOM_USART_CTRLC_HDRDLY_1_BIT_TIME_Val << SERCOM_USART_CTRLC_HDRDLY_Pos) /* (SERCOM_USART_CTRLC) Delay between break and sync transmission is one bit time. Delay between sync and ID transmission is one bit time. Position */
#define SERCOM_USART_CTRLC_HDRDLY_4_BIT_TIME  (SERCOM_USART_CTRLC_HDRDLY_4_BIT_TIME_Val << SERCOM_USART_CTRLC_HDRDLY_Pos) /* (SERCOM_USART_CTRLC) Delay between break and sync transmission is four bit times. Delay between sync and ID transmission is four bit times. Position */
#define SERCOM_USART_CTRLC_HDRDLY_8_BIT_TIME  (SERCOM_USART_CTRLC_HDRDLY_8_BIT_TIME_Val << SERCOM_USART_CTRLC_HDRDLY_Pos) /* (SERCOM_USART_CTRLC) Delay between break and sync transmission is eight bit times. Delay between sync and ID transmission is four bit times. Position */
#define SERCOM_USART_CTRLC_HDRDLY_14_BIT_TIME (SERCOM_USART_CTRLC_HDRDLY_14_BIT_TIME_Val << SERCOM_USART_CTRLC_HDRDLY_Pos) /* (SERCOM_USART_CTRLC) Delay between break and sync transmission is 14 bit times. Delay between sync and ID transmission is four bit times. Position */
#define SERCOM_USART_CTRLC_Msk                _UINT32_(0x00000F07)                                 /* (SERCOM_USART_CTRLC) Register Mask  */


/* -------- SERCOM_I2CM_BAUD : (SERCOM Offset: 0x0C) (R/W 32) I2CM Baud Rate -------- */
#define SERCOM_I2CM_BAUD_RESETVALUE           _UINT32_(0x00)                                       /*  (SERCOM_I2CM_BAUD) I2CM Baud Rate  Reset Value */

#define SERCOM_I2CM_BAUD_BAUD_Pos             _UINT32_(0)                                          /* (SERCOM_I2CM_BAUD) Host Baud Rate Position */
#define SERCOM_I2CM_BAUD_BAUD_Msk             (_UINT32_(0xFF) << SERCOM_I2CM_BAUD_BAUD_Pos)        /* (SERCOM_I2CM_BAUD) Host Baud Rate Mask */
#define SERCOM_I2CM_BAUD_BAUD(value)          (SERCOM_I2CM_BAUD_BAUD_Msk & (_UINT32_(value) << SERCOM_I2CM_BAUD_BAUD_Pos)) /* Assignment of value for BAUD in the SERCOM_I2CM_BAUD register */
#define SERCOM_I2CM_BAUD_BAUDLOW_Pos          _UINT32_(8)                                          /* (SERCOM_I2CM_BAUD) Host Baud Rate Low Position */
#define SERCOM_I2CM_BAUD_BAUDLOW_Msk          (_UINT32_(0xFF) << SERCOM_I2CM_BAUD_BAUDLOW_Pos)     /* (SERCOM_I2CM_BAUD) Host Baud Rate Low Mask */
#define SERCOM_I2CM_BAUD_BAUDLOW(value)       (SERCOM_I2CM_BAUD_BAUDLOW_Msk & (_UINT32_(value) << SERCOM_I2CM_BAUD_BAUDLOW_Pos)) /* Assignment of value for BAUDLOW in the SERCOM_I2CM_BAUD register */
#define SERCOM_I2CM_BAUD_Msk                  _UINT32_(0x0000FFFF)                                 /* (SERCOM_I2CM_BAUD) Register Mask  */


/* -------- SERCOM_SPI_BAUD : (SERCOM Offset: 0x0C) (R/W 8) SPI Baud Rate -------- */
#define SERCOM_SPI_BAUD_RESETVALUE            _UINT8_(0x00)                                        /*  (SERCOM_SPI_BAUD) SPI Baud Rate  Reset Value */

#define SERCOM_SPI_BAUD_BAUD_Pos              _UINT8_(0)                                           /* (SERCOM_SPI_BAUD) Baud Register Position */
#define SERCOM_SPI_BAUD_BAUD_Msk              (_UINT8_(0xFF) << SERCOM_SPI_BAUD_BAUD_Pos)          /* (SERCOM_SPI_BAUD) Baud Register Mask */
#define SERCOM_SPI_BAUD_BAUD(value)           (SERCOM_SPI_BAUD_BAUD_Msk & (_UINT8_(value) << SERCOM_SPI_BAUD_BAUD_Pos)) /* Assignment of value for BAUD in the SERCOM_SPI_BAUD register */
#define SERCOM_SPI_BAUD_Msk                   _UINT8_(0xFF)                                        /* (SERCOM_SPI_BAUD) Register Mask  */


/* -------- SERCOM_USART_BAUD : (SERCOM Offset: 0x0C) (R/W 16) USART Baud -------- */
#define SERCOM_USART_BAUD_RESETVALUE          _UINT16_(0x00)                                       /*  (SERCOM_USART_BAUD) USART Baud  Reset Value */

#define SERCOM_USART_BAUD_Msk                 _UINT16_(0x0000)                                     /* (SERCOM_USART_BAUD) Register Mask  */

/* ARITH mode */
#define SERCOM_USART_BAUD_ARITH_BAUD_Pos      _UINT16_(0)                                          /* (SERCOM_USART_BAUD) Baud Value Position */
#define SERCOM_USART_BAUD_ARITH_BAUD_Msk      (_UINT16_(0xFFFF) << SERCOM_USART_BAUD_ARITH_BAUD_Pos) /* (SERCOM_USART_BAUD) Baud Value Mask */
#define SERCOM_USART_BAUD_ARITH_BAUD(value)   (SERCOM_USART_BAUD_ARITH_BAUD_Msk & (_UINT16_(value) << SERCOM_USART_BAUD_ARITH_BAUD_Pos))
#define SERCOM_USART_BAUD_ARITH_Msk           _UINT16_(0xFFFF)                                     /* (SERCOM_USART_BAUD_ARITH) Register Mask  */

/* FRAC mode */
#define SERCOM_USART_BAUD_FRAC_BAUD_Pos       _UINT16_(0)                                          /* (SERCOM_USART_BAUD) Baud Value Position */
#define SERCOM_USART_BAUD_FRAC_BAUD_Msk       (_UINT16_(0x1FFF) << SERCOM_USART_BAUD_FRAC_BAUD_Pos) /* (SERCOM_USART_BAUD) Baud Value Mask */
#define SERCOM_USART_BAUD_FRAC_BAUD(value)    (SERCOM_USART_BAUD_FRAC_BAUD_Msk & (_UINT16_(value) << SERCOM_USART_BAUD_FRAC_BAUD_Pos))
#define SERCOM_USART_BAUD_FRAC_FP_Pos         _UINT16_(13)                                         /* (SERCOM_USART_BAUD) Fractional Part Position */
#define SERCOM_USART_BAUD_FRAC_FP_Msk         (_UINT16_(0x7) << SERCOM_USART_BAUD_FRAC_FP_Pos)     /* (SERCOM_USART_BAUD) Fractional Part Mask */
#define SERCOM_USART_BAUD_FRAC_FP(value)      (SERCOM_USART_BAUD_FRAC_FP_Msk & (_UINT16_(value) << SERCOM_USART_BAUD_FRAC_FP_Pos))
#define SERCOM_USART_BAUD_FRAC_Msk            _UINT16_(0xFFFF)                                     /* (SERCOM_USART_BAUD_FRAC) Register Mask  */


/* -------- SERCOM_USART_RXPL : (SERCOM Offset: 0x0E) (R/W 8) USART Receive Pulse Length -------- */
#define SERCOM_USART_RXPL_RESETVALUE          _UINT8_(0x00)                                        /*  (SERCOM_USART_RXPL) USART Receive Pulse Length  Reset Value */

